## VCS
brew 'git'
brew 'tig'

## Programming language version manager
brew 'rbenv'

## Utilities
tap 'sanemat/font'
brew 'ricty powerline', args: ['with-powerline']
brew 'jq'
brew 'nkf'
brew 'peco'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'vim', args: ['with-lua']
brew 'wget'

## gls
brew 'coreutils'

## Shell
brew 'zsh'

## Configuration Management
brew 'ansible'

## Homebrew-cask
tap 'phinze/homebrew-cask'
brew 'brew-cask'

cask 'android-studio'
cask 'adobe-reader'
cask 'alfred'
cask 'caffeine'
cask 'dropbox'
cask 'evernote'
# cask 'google-chrome'     # does NOT work with 1password
cask 'google-drive'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'java'
cask 'slack'
cask 'virtualbox'
cask 'vagrant'
cask 'vlc'

## Alfred link
cask 'alfred link'

