## VCS
brew 'git'
brew 'git-flow'
brew 'tig'

## Programming language version manager
brew 'rbenv'
brew 'ruby-build'

## Utilities
tap 'sanemat/font'
brew 'ricty powerline', args: ['with-powerline']
brew 'gist'
brew 'jq'
brew 'nkf'
brew 'rmtrash'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'tree'
brew 'vim', args: ['with-lua']
brew 'wget'

## Shell
brew 'zsh'

## Homebrew-cask
tap 'phinze/homebrew-cask'
brew 'brew-cask'

cask 'android-studio'
cask 'adobe-reader'
cask 'alfred'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'caffeine'
cask 'dropbox'
cask 'evernote'
cask 'github'
# cask 'google-chrome'     # does NOT work with 1password
cask 'google-drive'
cask 'google-japanese-ime'
cask 'hyperswitch'
cask 'iterm2'
cask 'java'
cask 'libreoffice'
cask 'limechat'
cask 'pandoc'
cask 'skype'
cask 'sourcetree'
cask 'tinkertool'
cask 'vlc'

## Alfred link
cask 'alfred link'

